app/processors/item_processor.rb

INSERT INTO `items` (`state`, `created_at`, `updated_at`, `product_id`) VALUES ('disponible', '2020-01-29 22:28:26.906676', '2020-01-29 22:28:26.906676', 1)
---
    def create_resource
        params[:data][:attributes] = { product_id: context[:product_id] }
        #params[:data][:attributes] = { sell_id: context[:sell_id] }
        data = params[:data]
        items = Array.new
        resource = nil
        result = nil
        if(context[:cantidad] > 0)
            context[:cantidad].times do # crea un solo item
                resource = resource_klass.create(context)
                result = resource.replace_fields(data)
                if(result == :completed)
                    items.push(resource)