app/processors/sell_processor.rb

INSERT INTO `sells` (`date`, `created_at`, `updated_at`, `user_id`, `cliente_dependiente_id`, `tipo_cliente`) VALUES ('2020-01-30 00:14:05', '2020-01-30 00:14:05.666221', '2020-01-30 00:14:05.666221', 1, 1, '{\"tipo-cliente\"=>\"dependiente\"}')
---
    def add_detail(id,cantidad, product_id, details)
      details.push(Detail.new(product_id: product_id, number_of_items: cantidad,sell_id: id ))

SELECT `sells`.* FROM `sells` WHERE 1=0 ORDER BY `sells`.`id` ASC
---
    def save_total(id,total)
      Sell.where("id = ?",id).update(total: total)