app/processors/sell_processor.rb

SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1  [["id", 1], ["LIMIT", 1]]
---
          result = evaluate_details_creation(id,cantidad)
          if result
            #agregar items a modificar
            price_per_unit = Product.find(id).cost_per_unit