app/processors/sell_processor.rb

    def create_resource
      # Podria usar metodo create_to_many_relationships, para crear la relacion con los detalles
      # Pasos para crear la venta: (solo con detalle, productos e items)
        # Crear venta y if:
        #   para todos: Crear detalle( producto existe y tiene stock suficiente)
        #                   controlar el tema de los items(si falla tambien deberia hacer rollback)
        # sino
        #   la libreria deberia encargarse de realizar rollback

      if(!context[:user].nil?)
        params[:data][:attributes][:date] = Time.now
        data = params[:data]
        resource = resource_klass.create(context)
        result = resource.replace_fields(data)
        # asi puedo recuperar el id del resource --> resource.id

        # Inicializacion de las variables
        details = []
        products = context[:data][:meta]
        to_store = []
        total = 0

        # Reviso que las condiciones esten dadas para cada producto
        products.each_key do |each|
          id = products[each][:product_id]
          cantidad = products[each][:cantidad]
          result = evaluate_details_creation(id,cantidad)
          if result
            #agregar items a modificar
            price_per_unit = Product.find(id).cost_per_unit
            total = total + price_per_unit * cantidad

            # crear los items una vez que estan creados los detalles
            items = Item.where(["product_id = ? AND state = ?", id, "disponible"]).first(cantidad)
            items.each do |item|
              item.sell_id = id
              item.state = 'vendido'
              item.sold_price = price_per_unit
              to_store.push(item)
            end
            details.push(Detail.new(product_id: id, number_of_items: cantidad,sell_id: resource.id ))
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1  [["id", 1], ["LIMIT", 1]]
SELECT `items`.* FROM `items` WHERE (product_id = 1 AND state = 'disponible') ORDER BY `items`.`id` ASC LIMIT 1
UPDATE `items` SET `items`.`sell_id` = 1, `items`.`state` = 'vendido', `items`.`updated_at` = '2020-01-30 01:52:24.478716' WHERE `items`.`id` = 1
INSERT INTO `details` (`number_of_items`, `created_at`, `updated_at`, `sell_id`, `product_id`) VALUES (4, '2020-01-29 16:14:24.485305', '2020-01-29 16:14:24.485305', 50, 1)

          end

          # Guardo el total en la venta
          Sell.where("id = ?",resource.id).update(total: total)

          # Almaceno detalles y actualizo los items
          details.each do |detail|
            detail.save()
          end
          to_store.each do |item|
            # Los items se actualizan mal. Ademas falta agregarles la clave de sell.
            Item.where("id = ?",item.id).update(state: item.state, sold_price: item.sold_price, sell_id: resource.id)
---
SELECT `sells`.* FROM `sells` WHERE (id = 33)
UPDATE `sells` SET `sells`.`total` = 199, `sells`.`updated_at` = '2020-01-30 16:30:39.067373' WHERE `sells`.`id` = 33
INSERT INTO `details` (`number_of_items`, `created_at`, `updated_at`, `sell_id`, `product_id`) VALUES (1, '2020-01-30 16:30:39.085840', '2020-01-30 16:30:39.085840', 33, 1)
UPDATE `sells` SET `sells`.`total` = 199, `sells`.`updated_at` = '2020-01-30 16:05:55.267954' WHERE `sells`.`id` = 29
SELECT `items`.* FROM `items` WHERE (id = 23)
UPDATE `items` SET `items`.`state` = 'vendido', `items`.`sold_price` = 199, `items`.`sell_id` = 33, `items`.`updated_at` = '2020-01-30 16:30:39.091550' WHERE `items`.`id` = 23

    def evaluate_details_creation(id, cantidad)
      product ||= Product.find(id)
          if (!product.nil?)
            if(product.items().disponibles().count() >= cantidad)
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
SELECT `items`.* FROM `items` WHERE (id = 21)