app/controllers/items_controller.rb

    def create
        puts params[:data]['attributes']['cantidad']

        @product = Product.find(params[:product_id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1