app/controllers/products_controller.rb

SELECT `products`.* FROM `products`
SELECT COUNT(*) FROM `items` WHERE `items`.`product_id` = 1
---
    def index
        # use params[:nombre_del_parametro], para recuperar el valor
        if(@user)
            @products = Product.all()

            if (params[:q] == 'in_stock')
                stock = Array.new
                @products.each do |product|
                    if(product.items.disponibles.count() > 0)
                        stock.push(product)
                    end
                end
                render json:serialize_product(stock)
            elsif
                (params[:q] == 'scarce')
                scarce = Array.new
                @products.each do |product|