app/controllers/sells_controller.rb

    def index
        return unless verify_accept_header

        if(@user)
            sells = Sell.where(user_id: @user.id)
            if(sells.size > 0)
---
SELECT `sells`.* FROM `sells` WHERE `sells`.`user_id` = 5 ORDER BY `sells`.`id` ASC
SELECT `sells`.* FROM `sells` WHERE 1=0 ORDER BY `sells`.`id` ASC

    def show
        return unless verify_accept_header

        if(@user)
            id = params[:id]
            sell = Sell.find(id)
---
SELECT `sells`.* FROM `sells` WHERE `sells`.`id` IS NULL ORDER BY `sells`.`id` ASC LIMIT 1