app/controllers/sessions_controller.rb

    def create
        return unless verify_content_type_header
        return unless verify_accept_header

        if( params[:data][:attributes][:username] and params[:data][:attributes][:password])
            user = User.find_by(username: params[:data][:attributes][:username])
---
SELECT `users`.* FROM `users` WHERE `users`.`username` = 'user7' LIMIT 1