app/controllers/sessions_handling.rb

    def is_authenticated?
        @user = User.find(decoded_auth_token[0]["user_id"]) if decoded_auth_token
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 5 LIMIT 1